app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  before_action :set_cors_headers

  skip_before_action :verify_authenticity_token
product = Product.first

SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "dress"], ["LIMIT", 1]]
SELECT "products"."url" FROM "products" INNER JOIN "categories" ON "categories"."id" = "products"."category_id" WHERE "categories"."name" = ?  [["name", "Clothing and Accessories"]]
---
  def show

  category = Category.find_by(name:params[:name])

    if category.nil?
      render json:{error:"No Name is found"}


    else
      # render the existing product data

      urls = Product.joins(:category).where(categories: { name: category.name }).pluck(:url)